tutorials/thermoFluidSolidInteraction/thermalCavity/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface thermal;

thermalCoeffs
{
    solidPatch left;
    fluidPatch right;

    predictTemperatureAndHeatFlux false;
    
    relaxationFactor 1;

    interfaceDeformationLimit 0;

    outerCorrTolerance 1e-6;
    nOuterCorr 100;

    interpolatorUpdateFrequency 0;

    coupled yes;

    writeResidualsToFile yes;
}

// ************************************************************************* //
