tutorials/thermoFluidSolidInteraction/thermalCavity/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 323;

boundaryField
{
    left
    {
        type            thermalRobin;

        // Apply neumann bc
        // dirichlet false;
        // neumann true;
        
        lambda k;
        
        value           $internalField;
    }
    right
    {
        type            fixedValue;
        value           uniform 323;
    }

    bottom
    {
        type            zeroGradient;
        value           $internalField;
    }
    
    top
    {
        type            zeroGradient;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
